    < 웹 API(Application Programming Interface) >

 어떤 사이트가 가지고 있는 기능을 외부에서 쉽게 사용할 수 있게 공개한 것

 원래 API는 어떤 프로그램 기능을 외부의 프로그램에서 호출해서 사용할 수 있게
만든 것을 의미

 간단히 말하자면 서로 다른 프로그램이 기능을 공유할 수 있게 절차나 규약을 정의한 것

 웹 API는 유료와 무료로 나뉜다


    < 웹 API를 제공하는 이유>

 대부분의 웹 서비스는 정보를 웹사이트를 통해서 제공한다. 이러한 정보는 크롤링의 대상이 된다.

 수많은 개발자들이 크롤링을 한다고 하면 서버에 부하가 많이 발생한다.

 따라서 크롤링으로 인해 서버에 부하가 걸리기 전에 미리 웹 API를 제공해서 서버의 부담을 줄인 것.

  결론적으로 웹 API를 제공하는 첫번째 이유는 서버의 부하를 감소시키는 것
 두번째 이유는 상품을 알리거나 판매할 기회를 더 많이 늘리기 위해서.


    < 웹 API를 사용시 유의사항 >

 웹 API 제공자의 문제로 인해서 API가 없어지는 경우 혹은 사양의 변화가 발생할 수가 있다.

 웹 API를 신뢰할 수 있는지 확인한다. 즉, 지원을 오래할 수 있는지, 수요가 많은지
큰 기업에서 제공하는지 등등
